Ping-Hsueh-Hsieh/stm32n6-camera/Application/NUCLEO-N657X0-Q/Src/main.c
static void NPUCache_config(void)
{
  npu_cache_enable();
}

static void Security_Config(void)
{
  __HAL_RCC_RIFSC_CLK_ENABLE();
  RIMC_MasterConfig_t RIMC_master = {0};
  RIMC_master.MasterCID = RIF_CID_1;
  RIMC_master.SecPriv = RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV;
  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_NPU, &RIMC_master);
  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_DMA2D, &RIMC_master);
  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_DCMIPP, &RIMC_master);
  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_LTDC1 , &RIMC_master);
  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_LTDC2 , &RIMC_master);
  HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_OTG1 , &RIMC_master);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_NPU , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_DMA2D , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_CSI    , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_DCMIPP , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDC   , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDCL1 , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDCL2 , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_OTG1HS , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_SPI5 , RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
}

static void IAC_Config(void)
{
/* Configure IAC to trap illegal access events */
  __HAL_RCC_IAC_CLK_ENABLE();
  __HAL_RCC_IAC_FORCE_RESET();
  __HAL_RCC_IAC_RELEASE_RESET();
}

void IAC_IRQHandler(void)
{
  while (1)
  {
  }
}

/**
* @brief Display Neural Network output classification results as well as other performances informations
*
* @param inference_ms inference time in ms
*/
static void Display_NetworkOutput(sseg_pp_out_t *p_postprocess, uint32_t inference_ms)
{
  uint8_t *mask = p_postprocess->pOutBuff;
  int ret;

  __disable_irq();
  ret = SCRL_SetAddress_NoReload(lcd_fg_buffer[lcd_fg_buffer_rd_idx], SCRL_LAYER_1);
  assert(ret == HAL_OK);
  __enable_irq();

  /* Draw post processing result */
  int x_lcd, y_lcd;
  float x_ratio_lcd, y_ratio_lcd, x_ratio_nn, y_ratio_nn;
  int work=0, len_work=0;
  uint16_t *lcd_fg_buffer_u16 = line_buffer_u16[work];

  /* Display mask */
  y_lcd = 0;
  y_ratio_lcd = (y_lcd + 1.0f) / (float) lcd_bg_area.YSize;
  for (int y_nn = 0; y_nn < AI_SSEG_DEEPLABV3_PP_HEIGHT; y_nn++)
  {
    y_ratio_nn = (y_nn + 1.0f) / (float) AI_SSEG_DEEPLABV3_PP_HEIGHT;

    while (y_ratio_lcd <= y_ratio_nn)
    {
      x_lcd = 0;
      x_ratio_lcd = (x_lcd + 1.0f) / (float) lcd_bg_area.XSize;

      for (int x_nn = 0; x_nn < AI_SSEG_DEEPLABV3_PP_WIDTH; x_nn++)
      {
        x_ratio_nn = (x_nn + 1.0f) / (float) AI_SSEG_DEEPLABV3_PP_WIDTH;

        while (x_ratio_lcd <= x_ratio_nn)
        {
          for (int i = 0; i < NB_CLASSES-1; i++)
            if (mask[y_nn * AI_SSEG_DEEPLABV3_PP_WIDTH + x_nn] == i+1)
            {
              lcd_fg_buffer_u16[len_work] = colors_u16[i % NUMBER_COLORS];
              break;
            }

          len_work++;

          x_lcd++;
          x_ratio_lcd = (x_lcd + 1.0f) / (float) lcd_bg_area.XSize;
        }
      }

      /* Clean filled line buffer to allow DMA copy */
      SCB_CleanDCache_by_Addr(line_buffer_u16[work], LCD_FG_WIDTH * 2);
      /* Wait for DMA transfer to end */
      while (!transferCompleteDetected);

      /* End of mask line : update variables */
      push = work;
      work = 1 - work;
      len_work = 0;
      lcd_fg_buffer_u16 = line_buffer_u16[work];

      /* Start DMA copy */
      transferCompleteDetected = 0;
      transferNeedClear = 1;
      ret = HAL_DMA_Start_IT(&handle_HPDMA1_Channel13,
                             (uint32_t) line_buffer_u16[push],
                             (uint32_t) &lcd_fg_buffer[lcd_fg_buffer_rd_idx][(y_lcd * LCD_FG_WIDTH)*2],
                             LCD_FG_WIDTH * 2);
      assert(ret == HAL_OK);

      y_lcd++;
      y_ratio_lcd = (y_lcd + 1.0f) / (float) lcd_bg_area.YSize;
    }
  }

  UTIL_LCD_SetBackColor(0x40000000);
  UTIL_LCDEx_PrintfAt(0, LINE(18), CENTER_MODE, "Inference: %ums", inference_ms);
  UTIL_LCD_SetBackColor(0);

  Display_WelcomeScreen();

  __disable_irq();
  ret = SCRL_ReloadLayer(SCRL_LAYER_1);
  assert(ret == HAL_OK);
  __enable_irq();
  lcd_fg_buffer_rd_idx = 1 - lcd_fg_buffer_rd_idx;
}

/**
 * @brief Bubble sorting algorithm on probabilities
 * @param prob pointer to probabilities buffer
 * @param classes pointer to classes buffer
 * @param size numer of values
 */
static void Bubblesort(float *prob, int *classes, int size)
{
  float p;
  int c;

  for (int i = 0; i < size; i++)
  {
    for (int ii = 0; ii < size - i - 1; ii++)
    {
      if (prob[ii] < prob[ii + 1])
      {
        p = prob[ii];
        prob[ii] = prob[ii + 1];
        prob[ii + 1] = p;
        c = classes[ii];
        classes[ii] = classes[ii + 1];
        classes[ii + 1] = c;
      }
    }
  }
}

static void Display_init(void)
{
  SCRL_LayerConfig layers_config[2] = {
    {
      .origin = {lcd_bg_area.X0, lcd_bg_area.Y0},
      .size = {lcd_bg_area.XSize, lcd_bg_area.YSize},
      .format = SCRL_RGB565,
      .address = lcd_bg_buffer,
    },
    {
      .origin = {lcd_fg_area.X0, lcd_fg_area.Y0},
      .size = {lcd_fg_area.XSize, lcd_fg_area.YSize},
      .format = SCRL_ARGB4444,
      .address = lcd_fg_buffer[lcd_fg_buffer_rd_idx],
    },
  };
  SCRL_ScreenConfig screen_config = {
    .size = {LCD_FG_WIDTH, LCD_FG_HEIGHT},
#ifdef SCR_LIB_USE_SPI
    .format = SCRL_RGB565,
#else
    .format = SCRL_YUV422, /* Use SCRL_RGB565 if host support this format to reduce cpu load */
#endif
    .address = screen_buffer,
    .fps = CAMERA_FPS,
  };
  int ret;

  /* Initialize the LCD to black */
#ifdef SCR_LIB_USE_SPI
  memset(screen_buffer, 0, sizeof(screen_buffer));
  SCB_CleanDCache_by_Addr(screen_buffer, sizeof(screen_buffer));
#else
  uint32_t *p_screen_buffer = (uint32_t *) screen_buffer;
  for (int i = 0; i < sizeof(screen_buffer)/4; i++)
  {
    p_screen_buffer[i] = 0x80108010;
  }
  SCB_CleanDCache_by_Addr(screen_buffer, sizeof(screen_buffer));
#endif

  ret = SCRL_Init((SCRL_LayerConfig *[2]){&layers_config[0], &layers_config[1]}, &screen_config);
  assert(ret == 0);

