Ping-Hsueh-Hsieh/stm32n6-camera/Application/NUCLEO-N657X0-Q/Src/main.c
 /* DISCO & NUCLEO USART1 (PE5/PE6) */
  gpio_init.Mode      = GPIO_MODE_AF_PP;
  gpio_init.Pull      = GPIO_PULLUP;
  gpio_init.Speed     = GPIO_SPEED_FREQ_HIGH;
  gpio_init.Pin       = GPIO_PIN_5 | GPIO_PIN_6;
  gpio_init.Alternate = GPIO_AF7_USART1;
  HAL_GPIO_Init(GPIOE, &gpio_init);

  huart1.Instance          = USART1;
  huart1.Init.BaudRate     = 115200;
  huart1.Init.Mode         = UART_MODE_TX_RX;
  huart1.Init.Parity       = UART_PARITY_NONE;
  huart1.Init.WordLength   = UART_WORDLENGTH_8B;
  huart1.Init.StopBits     = UART_STOPBITS_1;
  huart1.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_8;
  if (HAL_UART_Init(&huart1) != HAL_OK)
  {
    while (1);
  }
}

#define WRITE_UART 0
#define WRITE_ITM 1
#define WRITE_METHOD WRITE_ITM

int _write(int file, char *ptr, int len)
{
  if ((file != STDOUT_FILENO) && (file != STDERR_FILENO)) {
      errno = EBADF;
      return -1;
  }

#if (WRITE_METHOD == WRITE_UART)
  HAL_StatusTypeDef status;

  status = HAL_UART_Transmit(&huart1, (uint8_t*)ptr, len, ~0);

  return (status == HAL_OK ? len : 0);
#else
  int DataIdx;
  for (DataIdx = 0; DataIdx < len; DataIdx++)
  {
    ITM_SendChar(*ptr++);
  }
  return len;
#endif
}


void npu_cache_enable_clocks_and_reset(void)
{
  __HAL_RCC_CACHEAXIRAM_MEM_CLK_ENABLE();
  __HAL_RCC_CACHEAXI_CLK_ENABLE();
  __HAL_RCC_CACHEAXI_FORCE_RESET();
  __HAL_RCC_CACHEAXI_RELEASE_RESET();
}

void npu_cache_disable_clocks_and_reset(void)
{
  __HAL_RCC_CACHEAXIRAM_MEM_CLK_DISABLE();
  __HAL_RCC_CACHEAXI_CLK_DISABLE();
  __HAL_RCC_CACHEAXI_FORCE_RESET();
}

/**
  * @brief HPDMA1 Initialization Function
  * @param None
  * @retval None
  */
static void HPDMA1_Init(void)
{
  DMA_IsolationConfigTypeDef IsolationConfiginput;

  /* Peripheral clock enable */
  __HAL_RCC_HPDMA1_CLK_ENABLE();

  /* HPDMA1 interrupt Init */
  HAL_NVIC_SetPriority(HPDMA1_Channel13_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(HPDMA1_Channel13_IRQn);

  handle_HPDMA1_Channel13.Instance = HPDMA1_Channel13;
  handle_HPDMA1_Channel13.Init.Request = DMA_REQUEST_SW;
  handle_HPDMA1_Channel13.Init.BlkHWRequest = DMA_BREQ_SINGLE_BURST;
  handle_HPDMA1_Channel13.Init.Direction = DMA_MEMORY_TO_MEMORY;
  handle_HPDMA1_Channel13.Init.SrcInc = DMA_SINC_INCREMENTED;
  handle_HPDMA1_Channel13.Init.DestInc = DMA_DINC_INCREMENTED;
  handle_HPDMA1_Channel13.Init.SrcDataWidth = DMA_SRC_DATAWIDTH_HALFWORD;
  handle_HPDMA1_Channel13.Init.DestDataWidth = DMA_DEST_DATAWIDTH_HALFWORD;
  handle_HPDMA1_Channel13.Init.Priority = DMA_HIGH_PRIORITY;
  handle_HPDMA1_Channel13.Init.SrcBurstLength = 2;
  handle_HPDMA1_Channel13.Init.DestBurstLength = 2;
  handle_HPDMA1_Channel13.Init.TransferAllocatedPort = DMA_SRC_ALLOCATED_PORT0|DMA_DEST_ALLOCATED_PORT0;
  handle_HPDMA1_Channel13.Init.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
  handle_HPDMA1_Channel13.Init.Mode = DMA_NORMAL;
  assert(HAL_DMA_Init(&handle_HPDMA1_Channel13) == HAL_OK);
  assert(HAL_DMA_ConfigChannelAttributes(&handle_HPDMA1_Channel13, DMA_CHANNEL_PRIV|DMA_CHANNEL_SEC
                              |DMA_CHANNEL_SRC_SEC|DMA_CHANNEL_DEST_SEC) == HAL_OK);

  /* DMA channel */
  IsolationConfiginput.CidFiltering =  DMA_ISOLATION_ON;
  IsolationConfiginput.StaticCid = DMA_CHANNEL_STATIC_CID_1;

  assert(HAL_DMA_SetIsolationAttributes(&handle_HPDMA1_Channel13 , &IsolationConfiginput) == HAL_OK);

  /* Select Callbacks functions called after Transfer complete and Transfer error */
  HAL_DMA_RegisterCallback(&handle_HPDMA1_Channel13, HAL_DMA_XFER_CPLT_CB_ID, TransferComplete);
  HAL_DMA_RegisterCallback(&handle_HPDMA1_Channel13, HAL_DMA_XFER_ERROR_CB_ID, TransferError);
}

/**
  * @brief  DMA conversion complete callback
  * @note   This function is executed when the transfer complete interrupt
  *         is generated
  * @retval None
  */
static void TransferComplete(DMA_HandleTypeDef *hhpdma)
{
  if (transferNeedClear)
  {
    /* When data is copied into lcd_fg_buffer, clear line_buffer_u16 with zeros */
    int ret = HAL_DMA_Start_IT(&handle_HPDMA1_Channel13,
                             (uint32_t) line_buffer_zeros_u16,
                             (uint32_t) line_buffer_u16[push],
                             LCD_FG_WIDTH * 2);
    assert(ret == HAL_OK);
    transferNeedClear = 0;
  }
  else
  {
    /* When line_buffer_u16 is cleared, DMA transfer is over */
    SCB_InvalidateDCache_by_Addr(line_buffer_u16[push], LCD_FG_WIDTH * 2);
    transferCompleteDetected = 1;
  }
}

/**
  * @brief  DMA conversion error callback
  * @note   This function is executed when the transfer error interrupt
  *         is generated during DMA transfer
  * @retval None
  */
static void TransferError(DMA_HandleTypeDef *handle_HPDMA1_Channel13)
{
  transferErrorDetected = 1;
}

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{
  UNUSED(file);
  UNUSED(line);
  __BKPT(0);
  while (1)
  {
  }
}

#endif
